controllers/GalleryController.php

SELECT * FROM `picture`
SELECT COUNT(*) FROM `picture`
SELECT * FROM `file` WHERE `id` IN (1, 2, 3, 13, 14, 24, 25, 26, 27, 28, 31, 32)
SELECT COUNT(*) FROM `picture` WHERE (`category` IS NULL) AND (`title` LIKE '%%') AND (`id` LIKE '%%') AND (`category` LIKE '%%')
---
    public function actionGallery()
    {
        $items = ArrayHelper::map(Picture::find()->all(), 'category', 'category');
        $category = new Category();
        $filter = new Filter();
        $query = Picture::find()->with('file');
        if ($category->load(Yii::$app->request->post())) {
            $_SESSION['id'] = "";
            $_SESSION['categoryFilter'] = "";
            $_SESSION['title']="";
            if ($category->category == "") {
                $_SESSION['category'] = "All";
                $_SESSION['count'] = $query->count();
            } else {
                $_SESSION['category'] = $category->category;
                $_SESSION['count'] = $query->where(['category' => $_SESSION['category']])->count();
            }
        }
        if ($_SESSION['category'] != "All") {
            $query = $query->andWhere(['category' => $_SESSION['category']]);
        }
        if ($filter->load(Yii::$app->request->post())) {
            $_SESSION['id'] = $filter->id;
            $_SESSION['title'] = $filter->title;
            $_SESSION['categoryFilter'] = $filter->category;
            $query = $query->andWhere(['like', 'title', $_SESSION['title']])
                           ->andWhere(['like', 'id', $_SESSION['id']])
                           ->andWhere(['like', 'category', $_SESSION['categoryFilter']]);
            $_SESSION['count'] = $query->count();